mediaMicroservices/wrk2/oneone3_60s_r150.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3154.085ms, rate sampling interval: 10977ms
  Thread calibration: mean lat.: 3214.838ms, rate sampling interval: 10797ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.55s     9.58s   40.44s    63.30%
    Req/Sec    23.38      4.44    28.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.60s 
 75.000%   27.48s 
 90.000%   35.29s 
 99.000%   40.44s 
 99.900%   41.32s 
 99.990%   41.62s 
 99.999%   41.62s 
100.000%   41.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5533.695     0.000000            1         1.00
    8601.599     0.100000          234         1.11
   11255.807     0.200000          466         1.25
   13516.799     0.300000          700         1.43
   16547.839     0.400000          931         1.67
   19595.263     0.500000         1164         2.00
   21102.591     0.550000         1280         2.22
   22577.151     0.600000         1397         2.50
   24412.159     0.650000         1513         2.86
   25526.271     0.700000         1630         3.33
   27475.967     0.750000         1747         4.00
   28278.783     0.775000         1804         4.44
   29327.359     0.800000         1862         5.00
   30425.087     0.825000         1920         5.71
   31408.127     0.850000         1979         6.67
   33144.831     0.875000         2037         8.00
   34045.951     0.887500         2067         8.89
   35323.903     0.900000         2095        10.00
   36667.391     0.912500         2124        11.43
   37519.359     0.925000         2155        13.33
   37945.343     0.937500         2183        16.00
   38109.183     0.943750         2198        17.78
   38305.791     0.950000         2212        20.00
   38797.311     0.956250         2228        22.86
   38961.151     0.962500         2240        26.67
   39223.295     0.968750         2256        32.00
   39321.599     0.971875         2263        35.56
   39518.207     0.975000         2271        40.00
   39649.279     0.978125         2278        45.71
   39944.191     0.981250         2284        53.33
   40108.031     0.984375         2291        64.00
   40206.335     0.985938         2297        71.11
   40271.871     0.987500         2298        80.00
   40435.711     0.989062         2304        91.43
   40599.551     0.990625         2306       106.67
   40665.087     0.992188         2310       128.00
   40697.855     0.992969         2311       142.22
   40763.391     0.993750         2313       160.00
   40796.159     0.994531         2316       182.86
   40828.927     0.995313         2317       213.33
   40861.695     0.996094         2319       256.00
   40861.695     0.996484         2319       284.44
   40927.231     0.996875         2320       320.00
   41025.535     0.997266         2321       365.71
   41189.375     0.997656         2322       426.67
   41222.143     0.998047         2324       512.00
   41222.143     0.998242         2324       568.89
   41222.143     0.998437         2324       640.00
   41222.143     0.998633         2324       731.43
   41320.447     0.998828         2325       853.33
   41320.447     0.999023         2325      1024.00
   41320.447     0.999121         2325      1137.78
   41615.359     0.999219         2327      1280.00
   41615.359     1.000000         2327          inf
#[Mean    =    20551.702, StdDeviation   =     9576.485]
#[Max     =    41582.592, Total count    =         2327]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2971 requests in 1.00m, 538.24KB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 26
Requests/sec:     49.51
Transfer/sec:      8.97KB