mediaMicroservices/wrk2/oneone3_60s_r60.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 263.254ms, rate sampling interval: 1059ms
  Thread calibration: mean lat.: 251.793ms, rate sampling interval: 940ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.94s     2.55s    8.57s    54.71%
    Req/Sec    25.12      9.44    40.00     76.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.17s 
 75.000%    5.08s 
 90.000%    7.02s 
 99.000%    8.57s 
 99.900%    9.08s 
 99.990%    9.25s 
 99.999%    9.25s 
100.000%    9.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      74.431     0.000000            1         1.00
     155.007     0.100000          257         1.11
     310.015     0.200000          514         1.25
    1135.615     0.300000          771         1.43
    1677.311     0.400000         1028         1.67
    2168.831     0.500000         1287         2.00
    2551.807     0.550000         1414         2.22
    2899.967     0.600000         1542         2.50
    3305.471     0.650000         1672         2.86
    3823.615     0.700000         1799         3.33
    5083.135     0.750000         1929         4.00
    5529.599     0.775000         1992         4.44
    5840.895     0.800000         2056         5.00
    6180.863     0.825000         2121         5.71
    6471.679     0.850000         2185         6.67
    6762.495     0.875000         2249         8.00
    6893.567     0.887500         2282         8.89
    7024.639     0.900000         2313        10.00
    7118.847     0.912500         2346        11.43
    7262.207     0.925000         2378        13.33
    7454.719     0.937500         2410        16.00
    7553.023     0.943750         2427        17.78
    7708.671     0.950000         2442        20.00
    7790.591     0.956250         2458        22.86
    7864.319     0.962500         2474        26.67
    8011.775     0.968750         2490        32.00
    8081.407     0.971875         2498        35.56
    8212.479     0.975000         2507        40.00
    8278.015     0.978125         2514        45.71
    8302.591     0.981250         2522        53.33
    8396.799     0.984375         2530        64.00
    8429.567     0.985938         2534        71.11
    8486.911     0.987500         2538        80.00
    8544.255     0.989062         2542        91.43
    8585.215     0.990625         2546       106.67
    8667.135     0.992188         2550       128.00
    8683.519     0.992969         2552       142.22
    8740.863     0.993750         2554       160.00
    8749.055     0.994531         2556       182.86
    8822.783     0.995313         2558       213.33
    8847.359     0.996094         2560       256.00
    8871.935     0.996484         2561       284.44
    8880.127     0.996875         2562       320.00
    9003.007     0.997266         2563       365.71
    9011.199     0.997656         2564       426.67
    9043.967     0.998047         2566       512.00
    9043.967     0.998242         2566       568.89
    9043.967     0.998437         2566       640.00
    9084.927     0.998633         2567       731.43
    9084.927     0.998828         2567       853.33
    9101.311     0.999023         2568      1024.00
    9101.311     0.999121         2568      1137.78
    9101.311     0.999219         2568      1280.00
    9207.807     0.999316         2569      1462.86
    9207.807     0.999414         2569      1706.67
    9207.807     0.999512         2569      2048.00
    9207.807     0.999561         2569      2275.56
    9207.807     0.999609         2569      2560.00
    9248.767     0.999658         2570      2925.71
    9248.767     1.000000         2570          inf
#[Mean    =     2935.594, StdDeviation   =     2552.239]
#[Max     =     9240.576, Total count    =         2570]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3202 requests in 1.00m, 582.12KB read
  Non-2xx or 3xx responses: 40
Requests/sec:     53.36
Transfer/sec:      9.70KB