mediaMicroservices/wrk2/oneone_60s_r150.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 4248.146ms, rate sampling interval: 12492ms
  Thread calibration: mean lat.: 4402.103ms, rate sampling interval: 12582ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.26s    10.27s   40.11s    59.56%
    Req/Sec    25.14      4.22    30.00     85.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.86s 
 75.000%   30.51s 
 90.000%   37.09s 
 99.000%   40.11s 
 99.900%   40.80s 
 99.990%   41.19s 
 99.999%   41.19s 
100.000%   41.19s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6053.887     0.000000            1         1.00
    9109.503     0.100000          253         1.11
   11673.599     0.200000          506         1.25
   14229.503     0.300000          759         1.43
   16596.991     0.400000         1011         1.67
   22855.679     0.500000         1264         2.00
   24854.527     0.550000         1390         2.22
   26427.391     0.600000         1517         2.50
   28246.015     0.650000         1643         2.86
   29442.047     0.700000         1769         3.33
   30507.007     0.750000         1896         4.00
   31342.591     0.775000         1960         4.44
   32292.863     0.800000         2022         5.00
   34177.023     0.825000         2085         5.71
   35651.583     0.850000         2149         6.67
   36405.247     0.875000         2215         8.00
   36732.927     0.887500         2244         8.89
   37093.375     0.900000         2275        10.00
   37453.823     0.912500         2307        11.43
   37847.039     0.925000         2340        13.33
   38240.255     0.937500         2370        16.00
   38436.863     0.943750         2385        17.78
   38666.239     0.950000         2401        20.00
   38797.311     0.956250         2418        22.86
   39026.687     0.962500         2434        26.67
   39256.063     0.968750         2451        32.00
   39354.367     0.971875         2458        35.56
   39485.439     0.975000         2466        40.00
   39583.743     0.978125         2472        45.71
   39747.583     0.981250         2481        53.33
   39845.887     0.984375         2488        64.00
   39878.655     0.985938         2492        71.11
   40009.727     0.987500         2496        80.00
   40075.263     0.989062         2501        91.43
   40140.799     0.990625         2505       106.67
   40206.335     0.992188         2508       128.00
   40271.871     0.992969         2510       142.22
   40337.407     0.993750         2512       160.00
   40402.943     0.994531         2515       182.86
   40435.711     0.995313         2516       213.33
   40534.015     0.996094         2520       256.00
   40534.015     0.996484         2520       284.44
   40534.015     0.996875         2520       320.00
   40566.783     0.997266         2521       365.71
   40599.551     0.997656         2522       426.67
   40730.623     0.998047         2523       512.00
   40730.623     0.998242         2523       568.89
   40796.159     0.998437         2524       640.00
   40796.159     0.998633         2524       731.43
   40861.695     0.998828         2525       853.33
   40861.695     0.999023         2525      1024.00
   40861.695     0.999121         2525      1137.78
   40959.999     0.999219         2526      1280.00
   40959.999     0.999316         2526      1462.86
   40959.999     0.999414         2526      1706.67
   40959.999     0.999512         2526      2048.00
   40959.999     0.999561         2526      2275.56
   41189.375     0.999609         2527      2560.00
   41189.375     1.000000         2527          inf
#[Mean    =    22257.199, StdDeviation   =    10269.198]
#[Max     =    41156.608, Total count    =         2527]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3037 requests in 1.00m, 556.52KB read
  Non-2xx or 3xx responses: 64
Requests/sec:     50.61
Transfer/sec:      9.27KB